gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot/User/platform_map.c
	return (char*)TCFG_SystemData.BuildTime;
}

/**********************************************************************************************************
 @Function			unsigned int TCFG_Utility_Get_Run_Time(void)
 @Description			TCFG_Utility_Get_Run_Time					: 读取系统运行时间
 @Input				void
 @Return				runtime
**********************************************************************************************************/
unsigned int TCFG_Utility_Get_Run_Time(void)
{
	return Stm32_GetSecondTick();
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_Utility_Get_Mvb_ModelType(void)
 @Description			TCFG_Utility_Get_Mvb_ModelType				: 读取设备类型
 @Input				void
 @Return				ModelType
**********************************************************************************************************/
unsigned short TCFG_Utility_Get_Mvb_ModelType(void)
{
	return MVB_MODEL_TYPE;
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_Utility_Get_RadarLibNum(void)
 @Description			TCFG_Utility_Get_RadarLibNum					: 读取雷达库版本号
 @Input				void
 @Return				RadarLibNum
**********************************************************************************************************/
unsigned char TCFG_Utility_Get_RadarLibNum(void)
{
	return tradar_get_lib_num();
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_Utility_Get_AlgoLibNum(void)
 @Description			TCFG_Utility_Get_AlgoLibNum					: 读取检测算法库版本号
 @Input				void
 @Return				RadarLibNum
**********************************************************************************************************/
unsigned char TCFG_Utility_Get_AlgoLibNum(void)
{
	return talgo_get_lib_num();
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_Utility_Get_SoftResetFlag(void)
 @Description			TCFG_Utility_Get_SoftResetFlag				: 读取设备重启标识符
 @Input				void
 @Return				SoftResetFlag
**********************************************************************************************************/
unsigned char TCFG_Utility_Get_SoftResetFlag(void)
{
	return SoftResetFlag;
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_Utility_Get_ReInitModuleCount(void)
 @Description			TCFG_Utility_Get_ReInitModuleCount				: 读取模块异常初始化次数
 @Input				void
 @Return				ReInitModuleCount
**********************************************************************************************************/
unsigned short TCFG_Utility_Get_ReInitModuleCount(void)
{
	return ReInitModuleGetCnt();
}

/**********************************************************************************************************
 @Function			unsigned short TCFG_Utility_Get_DistanceRange(void)
 @Description			TCFG_Utility_Get_DistanceRange				: 读取雷达检测范围
 @Input				void
 @Return				DistanceRange
**********************************************************************************************************/
unsigned short TCFG_Utility_Get_DistanceRange(void)
{
	return tradar_get_distance_range() - 4;
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_Utility_Get_Major_Softnumber(void)
 @Description			TCFG_Utility_Get_Major_Softnumber				: 读取Major_Softnumber
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_Utility_Get_Major_Softnumber(void)
{
	return SOFTWAREMAJOR + NETPROTOCAL + NETCARRIERTYPE;
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_Utility_Get_Sub_Softnumber(void)
 @Description			TCFG_Utility_Get_Sub_Softnumber				: 读取Sub_Softnumber
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_Utility_Get_Sub_Softnumber(void)
{
	return SOFTWARESUB;
}

/**********************************************************************************************************
 @Function			unsigned char TCFG_Utility_Get_Major_Hardnumber(void)
 @Description			TCFG_Utility_Get_Sub_Hardnumber				: 读取Major_Hardnumber
 @Input				void
 @Return				val
**********************************************************************************************************/
unsigned char TCFG_Utility_Get_Major_Hardnumber(void)
{
#if RADAR_MODEL_TYPE == RADAR_MODEL_V1
	return HARDWAREMAJOR_V1;
#elif RADAR_MODEL_TYPE == RADAR_MODEL_V2
	return HARDWAREMAJOR_V2;
#else
	#error RADAR_MODEL_TYPE Define Error
#endif
}

/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Softwear_Version_String(void)
 @Description			TCFG_Utility_Get_Softwear_Version_String			: 读取Softwear Version字符串
 @Input				void
 @Return				Softwear_Version_String
**********************************************************************************************************/
char* TCFG_Utility_Get_Softwear_Version_String(void)
{
	memset((void*)&TCFG_SystemData.SoftVersion, 0, sizeof(TCFG_SystemData.SoftVersion));
	
	sprintf((char*)TCFG_SystemData.SoftVersion, "%d:%d.%d", \
		TCFG_EEPROM_GetBootVersion(), TCFG_Utility_Get_Major_Softnumber(), TCFG_Utility_Get_Sub_Softnumber());
	
	return (char*)TCFG_SystemData.SoftVersion;
}

/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Hardwear_Version_String(void)
 @Description			TCFG_Utility_Get_Hardwear_Version_String			: 读取Hardwear Version字符串
 @Input				void
 @Return				Hadrwear_Version_String
**********************************************************************************************************/
char* TCFG_Utility_Get_Hardwear_Version_String(void)
{
	memset((void*)&TCFG_SystemData.HardVersion, 0, sizeof(TCFG_SystemData.HardVersion));
	
